
## Plan Result

[CI link](https://github.com/l-1cm-l/gha_playground/actions/runs/13850444343)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_s3_bucket.example_ex-3


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.example_ex-3 will be created
  + resource "aws_s3_bucket" "example_ex-3" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "202502121629t-ex-3"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"aws-googlecloud-terraform-plan","PRNumber":64,"Program":"tfcmt","SHA1":"ad18ab4a21ac5cfff31d3108ec1d662d5bf5c084","Vars":{},"WorkflowName":"terraform-plan"} -->